[
  {
    "id": 1924,
    "title": "Superman",
    "overview": "Mild-mannered Clark Kent works as a reporter at the Daily Planet alongside his crush, Lois Lane. Clark must summon his superhero alter-ego when the nefarious Lex Luthor launches a plan to take over the world.",
    "release_date": "1978-12-14",
    "vote_average": 7.151,
    "runtime": 144,
    "local_poster_path": "Data/posters/superman_1978.jpg",
    "type": "movie",
    "era": "Pre-DCEU Films"
  },
  {
    "id": 268,
    "title": "Batman",
    "overview": "Having witnessed his parents' brutal murder as a child, millionaire philanthropist Bruce Wayne fights crime in Gotham City disguised as Batman, a costumed hero who strikes fear into the hearts of villains. But when a deformed madman known as 'The Joker' seizes control of Gotham's criminal underworld, Batman must face his most ruthless nemesis ever while protecting both his identity and his love interest, reporter Vicki Vale.",
    "release_date": "1989-06-21",
    "vote_average": 7.236,
    "runtime": 126,
    "local_poster_path": "Data/posters/batman_1989.jpg",
    "type": "movie",
    "era": "Pre-DCEU Films"
  },
  {
    "id": 364,
    "title": "Batman Returns",
    "overview": "The monstrous Penguin, who dwells in the sewers beneath Gotham, joins up with corrupt mayoral candidate Max Shreck to topple the Batman once and for all. But when Shreck's timid assistant Selina Kyle finds out, and Shreck tries to kill her, she's transformed into the sexy Catwoman. She teams up with the Penguin and Shreck to destroy Batman, but sparks fly unexpectedly when she confronts the caped crusader.",
    "release_date": "1992-06-19",
    "vote_average": 6.9,
    "runtime": 126,
    "local_poster_path": "Data/posters/batman_returns_1992.jpg",
    "type": "movie",
    "era": "Pre-DCEU Films"
  },
  {
    "id": 414,
    "title": "Batman Forever",
    "overview": "Batman faces off against two foes: the schizophrenic, horribly scarred former District Attorney Harvey Dent, aka Two-Face, and the Riddler, a disgruntled ex-Wayne Enterprises inventor seeking revenge against his former employer by unleashing his brain-sucking weapon on Gotham City's residents. As the caped crusader also copes with tortured memories of his parents' murder, he has a new romance, with psychologist Chase Meridian.",
    "release_date": "1995-06-16",
    "vote_average": 5.448,
    "runtime": 121,
    "local_poster_path": "Data/posters/batman_forever_1995.jpg",
    "type": "movie",
    "era": "Pre-DCEU Films"
  },
  {
    "id": 415,
    "title": "Batman & Robin",
    "overview": "Batman and his sidekick Robin attempt to the foil the sinister schemes of a deranged set of new villains, most notably the melancholy Mr. Freeze, who wants to make Gotham City into an arctic region, and the sultry Poison Ivy, a botanical femme fatale. As the Dynamic Duo contend with these bad guys, a third hero, Batgirl, joins the ranks of the city's crime-fighters.",
    "release_date": "1997-06-20",
    "vote_average": 4.384,
    "runtime": 125,
    "local_poster_path": "Data/posters/batman_and_robin_1997.jpg",
    "type": "movie",
    "era": "Pre-DCEU Films"
  },
  {
    "id": 1452,
    "title": "Superman Returns",
    "overview": "Superman returns to discover his 5-year absence has allowed Lex Luthor to walk free, and that those he was closest to felt abandoned and have moved on. Luthor plots his ultimate revenge that could see millions killed and change the face of the planet forever, as well as ridding himself of the Man of Steel.",
    "release_date": "2006-06-28",
    "vote_average": 5.794,
    "runtime": 154,
    "local_poster_path": "Data/posters/superman_returns_2006.jpg",
    "type": "movie",
    "era": "Pre-DCEU Films"
  },
  {
    "id": 13183,
    "title": "Watchmen",
    "overview": "In a gritty and alternate 1985, the glory days of costumed vigilantes have been brought to a close by a government crackdown. But after one of the masked veterans is brutally murdered, an investigation into the killer is initiated. The reunited heroes set out to prevent their own destruction, but in doing so they uncover a sinister plot that puts all of humanity in grave danger.",
    "release_date": "2009-03-04",
    "vote_average": 7.347,
    "runtime": 163,
    "local_poster_path": "Data/posters/watchmen_2009.jpg",
    "type": "movie",
    "era": "Pre-DCEU Films"
  },
  {
    "id": 44912,
    "title": "Green Lantern",
    "overview": "For centuries, a small but powerful force of warriors called the Green Lantern Corps has sworn to keep intergalactic order. Each Green Lantern wears a ring that grants him superpowers. But when a new enemy called Parallax threatens to destroy the balance of power in the Universe, their fate and the fate of Earth lie in the hands of the first human ever recruited.",
    "release_date": "2011-06-14",
    "vote_average": 5.176,
    "runtime": 114,
    "local_poster_path": "Data/posters/green_lantern_2011.jpg",
    "type": "movie",
    "era": "Pre-DCEU Films"
  },
  {
    "id": 49521,
    "title": "Man of Steel",
    "overview": "A young boy learns that he has extraordinary powers and is not of this earth. As a young man, he journeys to discover where he came from and what he was sent here to do. But the hero in him must emerge if he is to save the world from annihilation and become the symbol of hope for all mankind.",
    "release_date": "2013-06-12",
    "vote_average": 6.64,
    "runtime": 143,
    "local_poster_path": "Data/posters/man_of_steel_2013.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 209112,
    "title": "Batman v Superman: Dawn of Justice",
    "overview": "Fearing the actions of a god-like Super Hero left unchecked, Gotham City’s own formidable, forceful vigilante takes on Metropolis’s most revered, modern-day savior, while the world wrestles with what sort of hero it really needs. And with Batman and Superman at war with one another, a new threat quickly arises, putting mankind in greater danger than it’s ever known before.",
    "release_date": "2016-03-23",
    "vote_average": 5.988,
    "runtime": 152,
    "local_poster_path": "Data/posters/batman_v_superman_dawn_of_justice_2016.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 297761,
    "title": "Suicide Squad",
    "overview": "From DC Comics comes the Suicide Squad, an antihero team of incarcerated supervillains who act as deniable assets for the United States government, undertaking high-risk black ops missions in exchange for commuted prison sentences.",
    "release_date": "2016-08-03",
    "vote_average": 5.92,
    "runtime": 122,
    "local_poster_path": "Data/posters/suicide_squad_2016.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 297762,
    "title": "Wonder Woman",
    "overview": "An Amazon princess comes to the world of Man in the grips of the First World War to confront the forces of evil and bring an end to human conflict.",
    "release_date": "2017-05-30",
    "vote_average": 7.214,
    "runtime": 141,
    "local_poster_path": "Data/posters/wonder_woman_2017.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 141052,
    "title": "Justice League",
    "overview": "Fuelled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne and Diana Prince assemble a team of metahumans consisting of Barry Allen, Arthur Curry and Victor Stone to face the catastrophic threat of Steppenwolf and the Parademons who are on the hunt for three Mother Boxes on Earth.",
    "release_date": "2017-11-15",
    "vote_average": 6.074,
    "runtime": 120,
    "local_poster_path": "Data/posters/justice_league_2017.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 297802,
    "title": "Aquaman",
    "overview": "Half-human, half-Atlantean Arthur Curry is taken on the journey of his lifetime to discover if he is worth of being a king.",
    "release_date": "2018-12-07",
    "vote_average": 6.871,
    "runtime": 143,
    "local_poster_path": "Data/posters/aquaman_2018.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 287947,
    "title": "Shazam!",
    "overview": "A boy is given the ability to become an adult superhero in times of need with a single magic word.",
    "release_date": "2019-03-29",
    "vote_average": 6.986,
    "runtime": 132,
    "local_poster_path": "Data/posters/shazam_2019.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 495764,
    "title": "Birds of Prey (and the Fantabulous Emancipation of One Harley Quinn)",
    "overview": "Harley Quinn joins forces with a singer, an assassin and a police detective to help a young girl who had a hit placed on her after she stole a rare diamond from a crime lord.",
    "release_date": "2020-02-05",
    "vote_average": 6.891,
    "runtime": 109,
    "local_poster_path": "Data/posters/birds_of_prey_2020.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 464052,
    "title": "Wonder Woman 1984",
    "overview": "A botched store robbery places Wonder Woman in a global battle against a powerful and mysterious ancient force that puts her powers in jeopardy.",
    "release_date": "2020-12-16",
    "vote_average": 6.387,
    "runtime": 151,
    "local_poster_path": "Data/posters/wonder_woman_1984_2020.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 436969,
    "title": "The Suicide Squad",
    "overview": "Supervillains Harley Quinn, Bloodsport, Peacemaker and a collection of nutty cons at Belle Reve prison join the super-secret, super-shady Task Force X as they are dropped off at the remote, enemy-infused island of Corto Maltese.",
    "release_date": "2021-07-28",
    "vote_average": 7.478,
    "runtime": 132,
    "local_poster_path": "Data/posters/the_suicide_squad_2021.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 436270,
    "title": "Black Adam",
    "overview": "Nearly 5,000 years after he was bestowed with the almighty powers of the Egyptian gods—and imprisoned just as quickly—Black Adam is freed from his earthly tomb, ready to unleash his unique form of justice on the modern world.",
    "release_date": "2022-10-19",
    "vote_average": 6.832,
    "runtime": 125,
    "local_poster_path": "Data/posters/black_adam_2022.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 594767,
    "title": "Shazam! Fury of the Gods",
    "overview": "Billy Batson and his foster siblings, who transform into superheroes by saying \"Shazam!\", are forced to get back into action and fight the Daughters of Atlas, who they must stop from using a weapon that could destroy the world.",
    "release_date": "2023-03-15",
    "vote_average": 6.448,
    "runtime": 130,
    "local_poster_path": "Data/posters/shazam_fury_of_the_gods_2023.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 298618,
    "title": "The Flash",
    "overview": "When his attempt to save his family inadvertently alters the future, Barry Allen becomes trapped in a reality in which General Zod has returned and there are no Super Heroes to turn to. In order to save the world that he is in and return to the future that he knows, Barry's only hope is to race for his life. But will making the ultimate sacrifice be enough to reset the universe?",
    "release_date": "2023-06-13",
    "vote_average": 6.622,
    "runtime": 144,
    "local_poster_path": "Data/posters/the_flash_2023.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 565770,
    "title": "Blue Beetle",
    "overview": "Recent college grad Jaime Reyes returns home full of aspirations for his future, only to find that home is not quite as he left it. As he searches to find his purpose in the world, fate intervenes when Jaime unexpectedly finds himself in possession of an ancient relic of alien biotechnology: the Scarab.",
    "release_date": "2023-08-16",
    "vote_average": 6.656,
    "runtime": 128,
    "local_poster_path": "Data/posters/blue_beetle_2023.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 572802,
    "title": "Aquaman and the Lost Kingdom",
    "overview": "Black Manta seeks revenge on Aquaman for his father's death. Wielding the Black Trident's power, he becomes a formidable foe. To defend Atlantis, Arthur (Aquaman) forges an alliance with his imprisoned brother. They must protect the kingdom.",
    "release_date": "2023-12-20",
    "vote_average": 6.565,
    "runtime": 124,
    "local_poster_path": "Data/posters/aquaman_and_the_lost_kingdom_2023.jpg",
    "type": "movie",
    "era": "DCEU"
  },
  {
    "id": 475557,
    "title": "Joker",
    "overview": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.",
    "release_date": "2019-10-01",
    "vote_average": 8.131,
    "runtime": 122,
    "local_poster_path": "Data/posters/joker_2019.jpg",
    "type": "movie",
    "era": "Elseworlds"
  },
  {
    "id": 414906,
    "title": "The Batman",
    "overview": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
    "release_date": "2022-03-01",
    "vote_average": 7.658,
    "runtime": 177,
    "local_poster_path": "Data/posters/the_batman_2022.jpg",
    "type": "movie",
    "era": "Elseworlds"
  }
]